Revit 2024 API
UIDocument.GetSketchGalleryOptions Method
 Gets the valid sketch gallery options of a family symbol.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IList<SketchGalleryOptions> GetSketchGalleryOptions(
	FamilySymbol familySymbol
)
Visual Basic
Public Function GetSketchGalleryOptions ( _
	familySymbol As FamilySymbol _
) As IList(Of SketchGalleryOptions)
Visual C++
public:
IList<SketchGalleryOptions>^ GetSketchGalleryOptions(
	FamilySymbol^ familySymbol
)
Parameters
familySymbol
Type: Autodesk.Revit.DB.FamilySymbol
 The family symbol.
Return Value
 The valid list of SketchGalleryOptions.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UIDocument Class
Autodesk.Revit.UI Namespace